;-----------------------------------------------------------------------------------------------------------------------
;Разработчиком и полноправным владельцем данного исходного кода является Удовиченко Константин Александрович,
;емайл:w5277c@gmail.com, по всем правовым вопросам обращайтесь на email.
;-----------------------------------------------------------------------------------------------------------------------
;06.09.2020  w5277c@gmail.com        Начало
;-----------------------------------------------------------------------------------------------------------------------

.include	"./inc/core/wait_1s.inc"

TSK_BEEPER_DATA:
	.db N16T,C4,D4,D4d,C4,D4,D4d,D4d,F4,G4,D4d,F4,G4,F4,G4,A4,F4,G4,A4,G4d,A4d,C5,G4d,A4d,C5,C5,P,C5,C5,C5,C5,E
	;.db N32,C2,D2,E2,F2,G2,A2,H2,C3,D3,E3,F3,G3,A3,H3,C4,D4,E4,F4,G4,A4,H4,C5,D5,E5,F5,G5,A5,H5,C6,D6,E
	;.DB N16,D4,D4,D4,D4,D4,D4,D4,D4,D4,D4,D4,D4,D4,D4,D4,D4,D4,D4,D4,D4,D4,D4,D4,D4,D4,D4,D4,D4,D4,D4,D4,D4,D4,E
TSK_BEEPER_INIT:
	MCALL CORE5277_READY
;--------------------------------------------------------
TSK_BEEPER_INFINITE_LOOP:
	LDI YH,high(TSK_BEEPER_DATA)|0x80								;Вызываем процедуру драйвера (данные мелодии берем из ROM)
	LDI YL,low(TSK_BEEPER_DATA)
	LDI TEMP,PID_BEEPER_DRV
	MCALL CORE5277_EXEC

	LDI TEMP,0x0f														;Пауза в 15 сеунд
	MCALL CORE5277_WAIT_1S

	RJMP TSK_BEEPER_INFINITE_LOOP
