;-----------------------------------------------------------------------------------------------------------------------
;Разработчиком и полноправным владельцем данного исходного кода является Удовиченко Константин Александрович,
;емайл:w5277c@gmail.com, по всем правовым вопросам обращайтесь на email.
;-----------------------------------------------------------------------------------------------------------------------
;30.08.2020  w5277c@gmail.com        Начало
;-----------------------------------------------------------------------------------------------------------------------

.include	"./inc/io/log_char.inc"

TSK_FREEMEM_INIT:
;	LDI ACCUM,0x05
;	MCALL CORE5277_RAM_REALLOC

	MCALL CORE5277_READY
;--------------------------------------------------------
TSK_FREEMEM_LOOP:
	LDI TEMP,'.'
	MCALL CORE5277_LOG_CHAR

	LDI TEMP_H,0x00
	LDI TEMP_L,0x00
	LDI TEMP,0x01
	MCALL CORE5277_WAIT_2MS

;	MCALL CORE5277_SUSPEND
	RJMP TSK_FREEMEM_LOOP
